dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/SPI0_1.0.xml
    <register id="SPI0_STAT" width="32" offset="0x1110" description="Status Register">
        <bitfield id="TFE" description="Transmit FIFO empty." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Transmit FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="TNF" description="Transmit FIFO not full" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FULL" value="0x0" description="Transmit FIFO is full."/>
            <bitenum id="NOT_FULL" value="0x1" description="Transmit FIFO is not full."/>
        </bitfield>
        <bitfield id="RFE" description="Receive FIFO empty." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Receive FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Receive FIFO is empty."/>
        </bitfield>
        <bitfield id="RNF" description="Receive FIFO not full" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="FULL" value="0x0" description="Receive FIFO is full."/>
            <bitenum id="NOT_FULL" value="0x1" description="Receive FIFO is not full."/>
        </bitfield>
        <bitfield id="BUSY" description="Busy" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="IDLE" value="0x0" description="SPI is in idle mode."/>
            <bitenum id="ACTIVE" value="0x1" description="SPI is currently transmitting and/or receiving data, or transmit FIFO is not empty."/>
        </bitfield>
    </register>
    <register id="SPI0_RXDATA" width="32" offset="0x1130" description="RXDATA Register">
        <bitfield id="DATA" description="Received Data
When PACKEN=1,two entries of the FIFO are returned as a 32-bit value. When PACKEN=0, 1 entry of FIFO is returned as 16-bit value.
As data values are removed by the receive logic from the incoming data frame, they are placed into the entry in the receive FIFO, pointed to by the current FIFO write pointer.
Received data less than 16 bits is automatically right justified in the receive buffer." begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="SPI0_TXDATA" width="32" offset="0x1140" description="TXDATA Register">
        <bitfield id="DATA" description="Transmit Data

When read, last written value will be returned. If the last write to this field was a 32-bit write (with PACKEN=1), 32-bits will be returned and if the last write was a 16-bit write (PACKEN=0), those 16-bits will be returned.  

When written, one or two FIFO entries will be written depending on PACKEN value. Data values are removed from the transmit FIFO one value at a time by the transmit logic. It is loaded into the transmit serial shifter, then serially shifted out onto the TXD output pin at the programmed bit rate. 

When a data size of less than 16 bits is selected, the user must right-justify data written to the transmit FIFO. The transmit logic ignores the unused bits." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>

</module>